# 地点配置
PLACES = ['码头', '工厂', '贫民窟', '旅馆', '教堂', '市政厅', '消防局', '池塘', '住宅区', '灯塔', '小巷', '学校', '隧道', '山道', '寺庙', '靶场', '医院', '森林', '海滩', '墓园', '井', '研究中心']
SAFE_PLACES = ['研究中心']
DIRECTIONS = ['东', '南', '西', '北']
DIRECTIONS_ENABLED = False # 是否启用方位

# 角色配置
ROLES = ['花蝴蝶', '鬼魂新娘', '死神', '黑商', '裁决者', '猎魔人', '双子星暗', '双子星光', '炼金魔女', '镜', '药剂师', '魔术师', '死灵术士', '天狗', '锁链师', '复仇者', '骑士', '女巫', '占星师', '企鹅', '灵鹿', '圣女', '变脸者', '女巫学徒', '石像鬼', '摄梦人', '上帝使徒', '守卫', '定序王子', '潜行者', '狼美人', '赏金猎人', '阴阳使者', '权贵公主', '灵媒师', '纵火犯', '圣诞老狼', '太极宗师', '月亮', '替罪羊', '隐者', '太阳', '白狼王', '侦探', '机械狼']
PASSWORDS = ['nabu82', 'gq4698', 'epnf65', 'twl294', '566125', 'prs304', 't21458', 'kork12', 'ive308', 'nzr602', 'o36584', 'yyam77', 'zbu863', 'pq6267', 'muyt04', 'b49311', 'tzdp44', 'v66581', 'fyz612', 'beg589', 'mw1743', 'ovh748', 'mesb20', 'h24625', 'wdd128', '012877', '532112', 'daf810', 'ofz963', 'c47646', '188576', 'n13930', '381010', 'gcdo51', 'vmkz71', 'qv1834', '138475', 'bgg319', 'sg8193', 'gro829', '323145', 'u39834', 'hahh44', '045567', 'vh1775']
DIRECTOR_PASSWORD = 'lj25trn6'
AUDIENCE_PASSWORD = 'test'

# 道具配置
# 可通过在道具和人物名称中增加"<职业>"来限制人物可使用的道具
# 人物的职业后面可以增加一个字，例如标有<弓箭>的武器可对应标有<弓箭>或<弓箭手>的人物
# 例如"[冷]<弓箭>诸葛连弩"只能被"酌杯<弓箭手>"使用，不能被"小妤<投掷手>"和"取酒"使用
ITEM_HOT_AOE = [ # AOE热武器（带持续伤害）
    '[橙]自然之力.晓',
    '[橙]自然之力.午',
    '[橙]自然之力.夜',
    '[橙]自然之力.日',
    '[橙]自然之力.月',
    '[橙]自然之力.星',
    '[橙]自然之力.水',
    '[橙]自然之力.火',
    '[橙]自然之力.风'
]
ITEM_HOT_AOE_DAMAGE = 40
ITEM_HOT_AOE_DAMAGE_LASTED = 10
ITEM_HOT_AOE_TIMES = 5
ITEM_HOT_VITAL = [ # 狙击类热武器
    '[紫]青龙偃月刀', '[紫]盘古斧', '[紫]宇宙双叉戟', '[紫]芭蕉扇',
    '[紫]风魔手里剑', '[紫]蔚蓝匕首', '[紫]北极星', '[紫]魔弹射手',
    '[紫]丘比特之弓', '[紫]费尔努特', '[紫]血翼指虎', '[紫]裁决之光'
]
ITEM_HOT_VITAL_DAMAGE = 30
ITEM_HOT_VITAL_TIMES = 10000
ITEM_HOT = [ # 热武器
    '[蓝]大太刀', '[蓝]死神镰刀', '[蓝]斩马刀',
    '[蓝]三叉戟', '[蓝]带电短刀', '[蓝]西洋剑',
    '[蓝]双节棍', '[蓝]荆棘之鞭', '[蓝]白羽扇',
    '[蓝]燃烧弹', '[蓝]复古扑克', '[蓝]强力回力镖',
    '[蓝]轻机枪', '[蓝]斯太尔AUG', '[蓝]AK-47',
    '[蓝]十字弩', '[蓝]诸葛连弩', '[蓝]火矢弓',
    '[蓝]铁砂掌', '[蓝]羽翼指虎', '[蓝]恶魔之爪',
]
ITEM_HOT_DAMAGE = 20
ITEM_HOT_TIMES = 10000
ITEM_COLD = [ # 冷兵器
    '[绿]佩剑', '[绿]战斧', '[绿]长矛', '[绿]皮鞭', '[绿]回力镖', '[绿]IM-10', '[绿]复合弓', '[绿]铁爪'
]
ITEM_COLD_DAMAGE = 10
ITEM_COLD_TIMES = 10000
ITEM_ENSURE = [] # 伤害减半
ITEM_PROTECT = ['[防]热情短裙', '[防]神职法衣', '[防]十字军重甲', '[防]管家服', '[防]光学迷彩服', '[防]御史衣', '[防]余晖之铠'] # 抵消若干点伤害
ITEM_PROTECT_VALUE = 5 # 防具抵御的伤害量
ITEM_LOCATOR = ['[GPS]心跳探测仪1', '[GPS]心跳探测仪2'] # 查看道具所在地点（GPS）
ITEM_TELESCOPE = ['[侦]手持式雷达1', '[侦]手持式雷达2'] # 查看人物持有的道具（望远镜）
ITEM_LOCK = ['[锁]生命树枝'] # 锁区域行动（电击棒）
ITEM_SHOW = ['[扬声]生命启示'] # 大喇叭（公示器）
ITEM_BOMB = ['[炸]遥控地雷'] # 暗杀系手榴弹
ITEM_BOMB_DAMAGE = 30
ITEM_KILL = [] # 暗杀系氰化钾
ITEM_PERFECT_CURE = ['[HP100]红花丹'] # 生命加满并抵消持续伤害
ITEM_PREMIUM_CURE = ['[HP50]十全大补汤'] # 生命+50并抵消持续伤害
ITEM_CURE = ['[HP30]绷带'] # 抵消持续伤害或生命+30
ITEM_BANDAGE = ['[HP10]鸟蛋'] # 抵消持续伤害或生命+10
ITEM_ACTIVE = ['[MP100]威士忌'] # 体力加满
ITEM_WATER = ['[MP50]鸡尾酒'] # 体力+50
ITEM_TEA = ['[MP20]矿泉水'] # 体力+20
ORDINARY_DAMAGE = 5 # 普通攻击伤害值
ITEM_CAPACITY = 6 # 背包容量上限
ITEM_WEAPON_CAPACITY = 6 # 持有武器数量上限
ITEM_OTHERS_CAPACITY = 6 # 持有其它道具数量上限

# 道具合成系统
# 格式：'升级器名称': [['新道具1名称', '所需道具', ...], ['新道具2名称', '所需道具', ...], ...]
# 即一个升级器可对应多个合成公式，使用该升级器时，优先挑选符合目标等级的公式，然后自动挑选第一个满足条件的公式合成
ITEM_TARGET_LEVELS = ['[蓝]', '[紫]', '[橙]']
ITEM_UPGRADE_MAP = {}
ITEM_UPGRADE_GENERATE_MAP = {
    '[合]自然升级器': [
        ['[橙]自然之力.晓',
         '[橙]自然之力.午',
         '[橙]自然之力.夜',
         '[橙]自然之力.日',
         '[橙]自然之力.月',
         '[橙]自然之力.星',
         '[橙]自然之力.水',
         '[橙]自然之力.火',
         '[橙]自然之力.风'],
        ['[紫]青龙偃月刀', '[紫]盘古斧', '[紫]宇宙双叉戟', '[紫]芭蕉扇',
         '[紫]风魔手里剑', '[紫]蔚蓝匕首', '[紫]北极星', '[紫]魔弹射手',
         '[紫]丘比特之弓', '[紫]费尔努特', '[紫]血翼指虎', '[紫]裁决之光'],
        ['[蓝]大太刀', '[蓝]死神镰刀', '[蓝]斩马刀',
         '[蓝]三叉戟', '[蓝]带电短刀', '[蓝]西洋剑',
         '[蓝]双节棍', '[蓝]荆棘之鞭', '[蓝]白羽扇',
         '[蓝]燃烧弹', '[蓝]复古扑克', '[蓝]强力回力镖',
         '[蓝]轻机枪', '[蓝]斯太尔AUG', '[蓝]AK-47',
         '[蓝]十字弩', '[蓝]诸葛连弩', '[蓝]火矢弓',
         '[蓝]铁砂掌', '[蓝]羽翼指虎', '[蓝]恶魔之爪'],
        ['[绿]佩剑', '[绿]战斧', '[绿]长矛', '[绿]皮鞭', '[绿]回力镖', '[绿]IM-10', '[绿]复合弓', '[绿]铁爪']
    ],
    '[合]人造升级器': [
        ['[紫]青龙偃月刀', '[紫]盘古斧', '[紫]宇宙双叉戟', '[紫]芭蕉扇',
         '[紫]风魔手里剑', '[紫]蔚蓝匕首', '[紫]北极星', '[紫]魔弹射手',
         '[紫]丘比特之弓', '[紫]费尔努特', '[紫]血翼指虎', '[紫]裁决之光'],
        ['[蓝]大太刀', '[蓝]死神镰刀', '[蓝]斩马刀',
         '[蓝]三叉戟', '[蓝]带电短刀', '[蓝]西洋剑',
         '[蓝]双节棍', '[蓝]荆棘之鞭', '[蓝]白羽扇',
         '[蓝]燃烧弹', '[蓝]复古扑克', '[蓝]强力回力镖',
         '[蓝]轻机枪', '[蓝]斯太尔AUG', '[蓝]AK-47',
         '[蓝]十字弩', '[蓝]诸葛连弩', '[蓝]火矢弓',
         '[蓝]铁砂掌', '[蓝]羽翼指虎', '[蓝]恶魔之爪'],
        ['[绿]佩剑', '[绿]战斧', '[绿]长矛', '[绿]皮鞭', '[绿]回力镖', '[绿]IM-10', '[绿]复合弓', '[绿]铁爪']
    ],
}
for k, v in ITEM_UPGRADE_GENERATE_MAP.items():
    ITEM_UPGRADE_MAP[k] = []
    for level in range(0, len(v) - 1):
        for x in v[level]:
            for y in v[level + 1]:
                ITEM_UPGRADE_MAP[k].append([x, y])
# import pprint
# pprint.pprint(ITEM_UPGRADE_MAP)

# Actions
MOVE = 'move'
SEARCH = 'search'
PICK = 'pick'
ATTACK = 'attack'
EQUIP = 'equip'
USE = 'use'
THROW = 'throw'
DELIVER = 'deliver'

# 体力消耗配置
COSTS = {
    MOVE: 5, SEARCH: 5, PICK: 0, ATTACK: 0, EQUIP: 0, USE: 0, THROW: 0, DELIVER: 105
}
RECOVER_STRENGTH_DAILY = 40
RECOVER_LIFE_RESTED = 25
